app/controllers/application_controller.rb

  def authenticate_request
    header = request.headers['Authorization']
    header = header.split(' ').last if header
    begin
      decoded = JWT.decode(header, Rails.application.secrets.secret_key_base).first
      puts "JWT"
      console.log(JWT.decode(header, Rails.application.secrets.secret_key_base).first)
      @current_user = User.find(decoded['user_id'])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]