app/controllers/blogs_controller.rb

  def index
    blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def create
    blog = Blog.new(blog_params)


    if blog.save
---
INSERT INTO "blogs" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "This has a blog with an image"], ["content", "cheese"], ["user_id", 3], ["created_at", "2024-03-03 01:25:57.970767"], ["updated_at", "2024-03-03 01:25:57.970767"]]