app/controllers/users_controller.rb

  def create
    result = UserService::Base.create_user(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "email", "username", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?)